chtMultiregionFoam/coarseMeshSphereOil/constant/sphere/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
// this is for pure copper
    specie
    {
        molWeight   63.546;
    }

    transport
    {
        // valid from -23C to 327C

        muCoeffs<8>     ( 0 0 0 0 0 0 0 0 );
        kappaCoeffs<8>  ( 454.25 -0.2913 0.0005 -3E-07 0 0 0 0 );
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     ( 186.58 1.492 -0.0042 6E-06 -3E-09 0 0 0 );

    // valid from -23C to 327C
    }
    equationOfState
    {
        rho     8960;
    }
}

// ************************************************************************* //
